app/controllers/pictures_controller.rb

  def create
    @picture = Picture.new(picture_params)

    respond_to do |format|
      if @picture.save
---
INSERT INTO "pictures" ("created_at", "date", "desc", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2016-01-09 03:20:59.883390"], ["date", "2016-01-09"], ["desc", "jfnjdsfsdjk"], ["name", "First post"], ["updated_at", "2016-01-09 03:20:59.883390"]]