app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "date", "desc", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2016-01-09 04:28:59.587493"], ["date", "2016-01-09"], ["desc", "jknfdsjf"], ["title", "second"], ["updated_at", "2016-01-09 04:28:59.587493"]]
---
def create
   @post = Post.new(post12_params)

   if @post.save

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "date" = $1, "desc" = $2, "updated_at" = $3 WHERE "posts"."id" = 1  [["date", "2016-01-10"], ["desc", "First post is nice"], ["updated_at", "2016-01-10 02:52:16.349738"]]
---
 def update
    @post = Post.find(params[:id])
      if @post.update_attributes(post12_params)